#### KeyBasedTreeEntriesLoadResults Members

---

|  |
| --- |
| KeyBasedTreeEntriesLoadResults Class   Constructors   Methods   Properties   See Also |

The  KeyBasedTreeEntriesLoadResults  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | KeyBasedTreeEntriesLoadResults | Creates an empty KeyBasedTreeEntriesLoadResults. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  KeyBasedTreeEntriesLoadResults |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFailureMessages | Get all error or warnings created while attempting to load KeyBasedTreeEntries. |
| Public method | GetFileReadErrors | Gets the names of any files which could not be read due to access errors. |
| Public method | GetFileSyntaxErrors | Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetKeyBasedTreeEntryErrors | Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors. |
| Public method | GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType) | Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

KeyBasedTreeEntriesLoadResults Class

Autodesk.Revit.DB Namespace